Tekla Open API Reference for Tekla Structures 2025
OBB.DistanceTo Method (Point)
 Calculates the distance from OBB to given point.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double DistanceTo(
	Point point
)
Public Function DistanceTo (
	point As Point
) As Double
Parameters
point
Type: Tekla.Structures.Geometry3d.Point
Point to calculate against.
Return Value
Type: Double
Distance from OBB to given point.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when null is assigned to the point parameter.
See Also
Reference
OBB Class
DistanceTo Overload
Tekla.Structures.Geometry3d Namespace